//**************************************************************************
// Учебный проект "Бегущие огни" для канала "Разумный мир" Yndex.ZEN
// Цикл статей "Микрокнтроллеры для начинающих"
// Версия 1 для ATmega328P (TQFP32)
// Компиляция и сборка avr-gcc версии 10 
//   avr-gcc -mmcu=atmega328p -Os run_light_avr_v1.c -o run_light_avr_v1.elf
//   avr-objcopy -j .text -j .data -O ihex run_light_avr_v1.elf run_light_avr_v1.hex
//**************************************************************************
//
// Использование выводов микроконтроллера (в скобках номер вывода):
// PC0 (23) - F1
// PC1 (24) - F2
// PC2 (25) - F3
// PC5 (28) - кнопка
//**************************************************************************

#include <stdint.h>

//
// Подключенные светодиоды
//

typedef struct {
    unsigned run_led_bits   : 3;        // Биты порта с подлюченными LED
    unsigned                : 5;
} run_led_t;

volatile run_led_t  PORTC   __attribute__((io(0x28)));
volatile run_led_t  DDRC    __attribute__((io(0x27)));;

#define RUN_LED     PORTC.run_led_bits

//
// Подключенная кнопка
//

typedef struct {
    unsigned        : 5;
    unsigned    btn : 1;                // Бит порта с подключенной кнопкой
    unsigned        : 2;
} btn_t;

volatile btn_t  PINC    __attribute__((io(0x26)));;

#define BTN         PINC.btn

//--------------------------------------------------------------------------
// Программная задержка без использования таймера
//
// param - длительность задержки в циклах. 1000 циклов примерно соответсвуют
//         18.4 мс
//--------------------------------------------------------------------------

void Delay(uint16_t param) {
    volatile uint16_t counter;
    counter=param;
    while(counter) {
        counter--;
    }
}

//--------------------------------------------------------------------------
// Аппартно-зависимая процедура начальной инициализации микроконтроллера
// Выполняет начальную настройку оборудования
//--------------------------------------------------------------------------

void MCU_Init() {
    DDRC.run_led_bits=0b111;       // Режим выхода
}

//==========================================================================

void main() {
    uint8_t direction;              // Направление бега огня
    
    MCU_Init();
    
    if(BTN)
        direction=1;                // Кнопка не нажата, F1-F2-F3
    else
        direction=0;                // Кнопка нажата, F3-F2-F1
        
//
// Основной программный цикл
//

    while (1) {
        if(direction) {
            if(!RUN_LED)
                RUN_LED=0b001;
            else
                RUN_LED <<= 1;
        } else {
            if(!RUN_LED)
                RUN_LED=0b100;
            else
                RUN_LED >>= 1;
        }
        Delay(5435);               // Задержка примерно 100 мс
    }
}
