//**************************************************************************
// Учебный проект "Бегущие огни" для канала "Разумный мир" Yndex.ZEN
// Цикл статей "Микрокнтроллеры для начинающих"
// Версия 1 для PIC16F630 (so-14)
// Компиляция cc5x 3.7D
//    cc5x -cu -cl1 -fINHX32 -Ln -Q -V -wf -AHPR -a -B run_light_pic_v1_cc5x.c
//**************************************************************************
//
// Использование выводов микроконтроллера (в скобках номер вывода):
// RC0 (10) - F1
// RC1  (9) - F2
// RC2  (8) - F3
// RC5  (5) - кнопка
//**************************************************************************

#include    <16F630.H>

//
// Конфигурация микроконтроллера
//
#pragma config  FOSC=INTRCIO
#pragma config  WDTE=OFF
#pragma config  PWRTE=ON
#pragma config  MCLRE=OFF
#pragma config  BOREN=OFF
#pragma config  CP=OFF
#pragma config  CPD=OFF

#define RUN_LED_MASK    0b00000111

#define BTN PORTC.5

#define GetRunLed() PORTC & RUN_LED_MASK

//--------------------------------------------------------------------------
// Процедура установки уровней на выводах подключения LED
//
// val - новые уровни на выводах
//--------------------------------------------------------------------------
void SetRunLed(uns8 val) {
    uns8    tmp;
    tmp=PORTC & (~RUN_LED_MASK);
    tmp|=val & RUN_LED_MASK;
    PORTC=tmp;
}

//--------------------------------------------------------------------------
// Программная задержка без использования таймера
//
// param - длительность задержки в циклах. 1000 циклов примерно соответсвуют
//         8.74 мс
//--------------------------------------------------------------------------

void Delay(uns16 param) {
    uns16 counter;
    counter=param;
    while(counter) {
        counter--;
    }
}

//--------------------------------------------------------------------------
// Аппартно-зависимая процедура начальной инициализации микроконтроллера
// Выполняет начальную настройку оборудования
//--------------------------------------------------------------------------

void MCU_Init() {
    TRISC&=~RUN_LED_MASK;       // Режим выхода
}

//==========================================================================

void main() {
    uns8 direction;                 // Направление бега огня
    uns8 tmp;
    
    MCU_Init();
    
    if(BTN)
        direction=1;                // Кнопка не нажата, F1-F2-F3
    else
        direction=0;                // Кнопка нажата, F3-F2-F1
        
//
// Основной программный цикл
//

    while (1) {
        tmp=GetRunLed();
        if(direction) {
            if(!tmp)
                SetRunLed(0b001);
            else {
                tmp <<= 1;
                SetRunLed(tmp);
            }
        } else {
            if(!tmp)
                SetRunLed(0b100);
            else {
                tmp >>= 1;
                SetRunLed(tmp);
            }
        }
        Delay(11442);               // Задержка примерно 100 мс
    }
}
