//**************************************************************************
// Учебный проект "Бегущие огни" для канала "Разумный мир" Yndex.ZEN
// Цикл статей "Микрокнтроллеры для начинающих"
// Версия 1 для PIC16F630 (so-14)
// Компиляция: MPLAB X 5.45 + XC8 2.31 (C90 + O2)
//**************************************************************************
//
// Использование выводов микроконтроллера (в скобках номер вывода):
// RC0 (10) - F1
// RC1  (9) - F2
// RC2  (8) - F3
// RC5  (5) - кнопка
//**************************************************************************

// CONFIG
#pragma config FOSC = INTRCIO
#pragma config WDTE = OFF
#pragma config PWRTE = OFF
#pragma config MCLRE = OFF
#pragma config BOREN = OFF
#pragma config CP = OFF
#pragma config CPD = OFF

#include <stdint.h>

//
// Подключение кнопки и LED
//
typedef struct {
    unsigned run_led_bits   : 3;        // Биты порта с подлюченными LED
    unsigned                : 2;
    unsigned btn            : 1;        // Подключенная кнопка
    unsigned                : 2;
} run_led_t;

extern volatile run_led_t   PORTC   __at(0x007);
extern volatile run_led_t   TRISC   __at(0x087);

#define RUN_LED     PORTC.run_led_bits
#define BTN         PORTC.btn

//--------------------------------------------------------------------------
// Программная задержка без использования таймера
//
// param - длительность задержки в циклах. 1000 циклов примерно соответсвуют
//         10,5 мс
//--------------------------------------------------------------------------

void Delay(uint16_t param) {
    volatile uint16_t counter;
    counter=param;
    while(counter) {
        counter--;
    }
}

//--------------------------------------------------------------------------
// Аппартно-зависимая процедура начальной инициализации микроконтроллера
// Выполняет начальную настройку оборудования
//--------------------------------------------------------------------------

void MCU_Init() {
    TRISC.run_led_bits=0;       // Режим выхода
}

//==========================================================================

void main() {
    uint8_t direction;              // Направление бега огня
    
    MCU_Init();
    
    if(BTN)
        direction=1;                // Кнопка не нажата, F1-F2-F3
    else
        direction=0;                // Кнопка нажата, F3-F2-F1
        
//
// Основной программный цикл
//

    while (1) {
        if(direction) {
            if(!RUN_LED)
                RUN_LED=0b001;
            else
                RUN_LED <<= 1;
        } else {
            if(!RUN_LED)
                RUN_LED=0b100;
            else
                RUN_LED >>= 1;
        }
        Delay(9524);               // Задержка примерно 100 мс
    }
}
